{
  "clients": [
    {
      "id": 0,
      "industry": "Art Gallery / Consignment Sales",
      "location": "Provincetown, MA",
      "description": "Setting-up consignment payment schedule, Tracking artist and inventory, Payroll liaison and maintenance, A/R maintenance, Account maintenance and monthly reconciliations, Liaison to accountant.",
      "quotes": [
        {
          "quote": "<p>I approached Linda in 2017 after making a mess of my Quickbooks Online® company's chart of accounts. I had no idea how to capture the true income deducting out the artist consignments and I couldn't track the credit card income minus the fees. My payroll reports are complicated and unreadable making liabilities hard to track. <span class='client-quote-highlight' >Linda is fabulous!</span > She straightened out my previous year's accounts and created an understandable consignment tracking schedule. She diligently maintains my monthly reconciliations and breaks out each payroll report into trackable liabilities. (Including pointing out miscalculations by my payroll company during 2018 Q2.) </p> <p> I am indebted to Linda for organizing and maintaining my accounts on Quickbooks®. </p>",
          "author": "SC, Provincetown MA",
          "highlight": "Linda is fabulous!"
        }
      ]
    },
    {
      "id": 1,
      "industry": "Assisted Living Facility",
      "location": "Brightside Manor, Teaneck NJ",
      "description": "Tracking patient payments – Hired to track lapse of A/R from Medicare",
      "quotes": [
        {
          "quote": "<p> Brightside is a small, non-profit 501(c)3 facility in Bergen County, NJ. Linda was hired in 2015 to negotiate through a nightmare accounts receivable issue with Medicare. During the Affordable Care Act transition, there was a halt of what had been systematic Medicare payments. Suddenly baffling threads of inexplicable credits were outweighed by unauthorized debits, critically affecting our bank balances. </p> <p> Linda managed to untangle the financial tracking per patient. She wanted to utilize Quickbooks® as the conduit for tracking, but due to investigative accountability (Brightside uses Quickbooks® for our financial reports and a “second” company file may have raised audit concerns), Linda used Excel® for her tracking creating a financial database thread for each patient. Although the information took longer to input in this manner, Linda’s file allowed Brightside to resolve this financially restrictive matter. With Linda’s diligence we had a map of all the payments still owed to us. <span class='client-quote-highlight' >She was instrumental in helping Brightside resolve what could have been a financial disaster to our small facility.</span > </p>",
          "author": "ED, Teaneck NJ",
          "highlight": "instrumental"
        }
      ]
    },
    {
      "id": 2,
      "industry": "Equipment Rental",
      "location": "Goblin Lighting Services, Inc, Staten Island, NY",
      "description": "Full Charge AP/AR, Payroll maintenance, Sales tax, Inventory tracking, Account maintenance and reconciliations, Monthly and annual financial reports, Accountant liaison",
      "quotes": [
        {
          "quote": "<p> As owner of a small business, I began using Quickbooks® in the 1990’s until the company was sold in 2013. Although not set up for equipment rental, <span class='client-quote-highlight' >the program is malleable and able to adapt to any industry</span >. I designed a system able to follow rentals. As the company grew, Quickbooks® made financial tracking easier allowing me more time to focus on my executive duties. Once a bookkeeper was hired, Intuit’s security options allowed for lower level employee input of information without access to more sensitive reports and numbers. </p> <p> Owning a successful company was assisted by the Quickbooks® small business accounting program and the financial education it provides. I hope to take this knowledge and help others get the full benefit of all the advantages Quickbooks® has to offer. </p>",
          "author": "ED, Teaneck NJ",
          "highlight": "able to adapt"
        }
      ]
    },
    {
      "id": 3,
      "industry": "Family Estate Management",
      "location": "Clients Upon Request",
      "description": "Hired by family members to track family trust accounts and oversee senior parents finances, monthly reconciliations and account maintenance, Annual financial reports, Liaison to family and accountant.",
      "quotes": [
        {
          "quote": "<p> When our father passed away, we were left with a mass of unorganized family trusts and investment accounts to sort out. Hiring Linda avoided any feelings of sibling inequity. She entered hand written accounts into Quickbooks® allowing us to distribute proper and concise reports to family and executor. </p> <p> Linda’s diligence and abilities assisted us tremendously. <span class='client-quote-highlight' >I would recommend her to any family looking for an honest and subjective entity to sort out confusing or emotional estate finances.</span > </p>",
          "author": "EDM, Oyster Bay NY",
          "highlight": "diligence"
        },
        {
          "quote": "<p> Our accountant recommended we hire someone to track the very complicated income and expense finances of our family trust account, which involves several ongoing projects. <span class='client-quote-highlight' >Linda immediately understood what was expected and has alleviated enormous confusion and frustration on behalf of our accountant.</span > </p>",
          "author": "VWC, Veneta OR",
          "highlight": "alleviated"
        }
      ]
    },
    {
      "id": 4,
      "industry": "Film Production / Computer Animation",
      "location": "Surround, Brooklyn, NY",
      "description": "Accountant liaison, Input annual financial information onto QuickBooks",
      "quotes": [
        {
          "quote": "<p> Surround was a challenge to our accounting firm. We are a small company competing against much larger corporations; so many responsibilities get left aside when they are not a part of the creative process. Linda has been hired to track receipts and transfer our financials onto Quickbooks® to give our accountant annual reports and reconciliations. </p> <p> Having been involved in many aspects of film, television, and commercial production for decades, Linda understands the process and knows where to track our income and expenses properly. I know she will keep not only our financial information private, but <span class='client-quote-highlight' >she is trusted to keep our sensitive projects and clients confidential.</span > </p>",
          "author": "BP, Brooklyn NY",
          "highlight": "trusted"
        }
      ]
    },
    {
      "id": 5,
      "industry": "Medical Practice",
      "location": "Voice, Speech, & Language Pathology, Staten Island, NY",
      "description": "Input medical billing program onto Quickbooks®; ability to adjust for co-pays and insurance deductions creating true A/R and complete financial statements and annual reports; trained owner to maintain accounts and to complete payroll taxes without accountant expense.",
      "quotes": [
        {
          "quote": "<p>Medical billing is multi-layered; entailing dual billing tracking between patient co-pays and insurance invoices, further complicated by additional insurance deductions post billing. Former computer programs for this kind of service can cost tens of thousands of dollars. Having a small practice, I cannot afford these programs. </p> <p> Linda created a Quickbooks® company for me allowing me – for the first time in 8 years – to see my business financial reports. Among many other things, I am now able to track all my A/R – patients and insurance companies – and accounts payable with ease. </p> <p> Linda is a proficient bookkeeper. Her in-depth knowledge of running a business and her Quickbooks® proficiency are strengths to be desired. She is an honest, reliable, dedicated, organized, hardworking, and warm-hearted professional and I believe that any company who hires hew will surely find her abilities and strengths to be an asset to their corporation and team. <span class='client-quote-highlight' >I would recommend her without any reservation.</span > </p>",
          "author": "FLL, Staten Island NY",
          "highlight": "honest, reliable, dedicated"
        }
      ]
    },
    {
      "id": 6,
      "industry": "Personal Finance Management",
      "location": "Clients Upon Request",
      "description": "Hired to track finances, Monthly reconciliations, Annual financial reports, Liaison to accountant",
      "quotes": [
        {
          "quote": "<p>Linda was hired to input our personal accounts onto Quickbooks® as our expenses must be clearly classed out due to many current projects we are involved in. We simply don’t have the time to properly track these and our accountant was costing too much to do it for us. We receive monthly reconciliations and quarterly reports are sent to our accountant, making everyone happy. </p>",
          "author": "JWC, Veneta OR",
          "highlight": "everyone [is] happy"
        },
        {
          "quote": "<p> My wife always handled our finances. When we separated I hired Linda to continue. She makes sure my bills are paid and that I have enough money in my bank account. <span class='client-quote-highlight' >I receive quarterly reports including all my assets and liabilities, and she makes sure all documents and reports are delivered to my accountant.</span > Honestly, I would be out on the street if it weren’t for Linda watching over my finances! </p>",
          "author": "JB, Staten Island NY",
          "highlight": "delivered"
        }
      ]
    },
    {
      "id": 7,
      "industry": "Real Estate",
      "location": "Three Muses Group LLC, Eugene OR",
      "description": "Hired to track finances of multiple construction sites and real estate holdings, Monthly reconciliations, Quarterly and annual reporting, Liaison and report maintenance to accountant.",
      "quotes": [
        {
          "quote": "<p>TMG is investing in Eugene’s future. A vibrant town with history, Eugene has so much to offer. Three Muses Group has been successful in the gentrification of several neighborhoods and we are moving forward with several new projects in areas with potential that we are excited about. TMG is currently involved in several real estate projects – residential units, restaurants, commercial and office space. This leaves little time for proper bookkeeping. Although we are a small entity, our accounts are complicated and our accountant insisted we organize our finances. We have hired Linda to track several company files. During a very productive meeting with our accountant, Linda showed her obvious talents and we knew we had hired the right person to do the job. </p> <p> On Quickbooks®, Linda has created trackable accounts for each entity, and has been producing monthly reconciliations, quarterly, and annual reports for our accountant. <span class='client-quote-highlight' >For the first time in years, our financials are to date.</span > We are so appreciative of Linda’s ability to understand our multi-layered procedures, her attention to detail, her knowledge of the financial process and small business practices. I would recommend Linda without hesitation. </p>",
          "author": "VWC, Eugene OR",
          "highlight": "obvious talents"
        }
      ]
    },
    {
      "id": 8,
      "industry": "Religious Organization",
      "location": "St. John’s Church, Staten Island, NY",
      "description": "Hired to re-organize company financials and chart of account on Quickbooks® desktop, Trained church treasurer to input and track A/P, A/R, maintain accounts, and prepare reports for Church Board.",
      "quotes": [
        {
          "quote": "<p>Although our bookkeeping set-up had been on Quickbooks®, the chart of accounts and system of recording income and expenses was lacking in organization, making the reports too difficult to read or understand. </p> <p> Linda was terrific. She understood what needed to be done and quickly provided a cohesive chart of accounts. She was able to explain to our new Treasurer the ins and outs of the Quickbooks® program. <span class='client-quote-highlight' >She offered many tips on small business procedures and quickly pointed out expenses that could be eliminated without consequence.</span > </p> <p> The church is now able to input accounts payable and record split income categories allowing us to print out clear and concise P&L statements. For the first time, we are now able to set up proper spending budgets! The clarity of our financials is giving us the ability to cut back on expenses and know where the individual sources of income are coming from, and going to. </p> <p> St. John is grateful for Linda’s services and we highly recommend her talents to any small business for assistance in the Quickbooks® program and proper bookkeeping strategies. </p>",
          "author": "VM, Staten Island NY",
          "highlight": "clarity"
        }
      ]
    },
    {
      "id": 9,
      "industry": "Sales",
      "location": "Goblin Lighting Services, Inc., Staten Island, NY",
      "description": "Full Charge AP/AR, Inventory tracking, Sales tax, Inventory tracking, Account maintenance and reconciliations, Monthly and annual financial reports, Accountant liaison",
      "quotes": [
        {
          "quote": "<p>As owner (meaning CEO, COO, CFO, bookkeeper, secretary, janitor, etc.) of a small business for over 30 years, my company would not have been as successful as it was without the Quickbooks® accounting program. Charts of accounts can be designed to fit any company, however if one doesn’t understand the financial process, it can be difficult to set up the program properly. <span class='client-quote-highlight' >I can offer my services in any capacity; from simple bookkeeping to structuring and maintaining accounts.</span > </p>",
          "author": "LB",
          "highlight": "structuring and maintaining"
        }
      ]
    },
    {
      "id": 10,
      "industry": "Senior Finance Management",
      "location": "Clients Upon Request",
      "description": "Hired by family members to oversee senior parents finances, monthly reconciliations and account maintenance, Annual financial reports, Liaison to family and accountant.",
      "quotes": [
        {
          "quote": "<p>My father was always in charge of his finances, creating his own financial excel spreadsheet in the 1980’s. When he moved into assisted living in 2018 at the age of 92, he began to lose track of auto debits and such. Linda has been terrific. She sat with dad and structured his Quickbook® files to reflect his own, rather odd, way of thinking. He calls her several times a week to “find out his bank balance”, but I know he just likes to speak to her. I hear him laughing and comfortable. I receive monthly reconciliations from her, keeping me on top of dad’s situation. <span class='client-quote-highlight' >She has also pointed out several erroneous expenses</span > that dad was paying, so I know she has his best interest at heart. </p>",
          "author": "LHR, Phoenix AZ",
          "highlight": "terrific"
        }
      ]
    },
    {
      "id": 11,
      "industry": "Trucking",
      "location": "Goblin Lighting Services, Inc., Staten Island, NY",
      "description": "Full Charge AP/AR, Highway Use Tax (HUT), International Fuel Tax (IFTA), International Registration Plan (IRP), Dept of Transportation (DOT) guidelines, Federal Motor Carrier Safety Administration (FMCSA) guidelines, International Brotherhood of Teamsters (IBT 817) signatory",
      "quotes": [
        {
          "quote": "<p>All my equipment – sales and rentals – were transported on trucks. Our commercial fleet contained vans, step vans, straight trucks, and tractor-trailers up to 65000 gvw; all driven by IBT teamsters. The licenses, fees, insurance, permits, contracts, and bookkeeping tracking for trucks is daunting. <span class='client-quote-highlight' >I have extensive knowledge of all these procedures and guidelines.</span > </p>",
          "author": "LHR, Phoenix AZ",
          "highlight": "extensive knowledge"
        }
      ]
    },
    {
      "id": 12,
      "industry": "Vineyard",
      "location": "Equinox Vineyard, Veneta, OR",
      "description": "Hired to track finances, Monthly reconciliations, Annual financial reports, Liaison to accountant",
      "quotes": [
        {
          "quote": "<p>Equinox is a small family owned vineyard. Linda does a great job for us, tracking income and expenses, reconciling accounts and providing monthly and annual reports to our accountant on Quickbooks®. Linda’s monthly fee is nominal to do these simple accounts. She tracks other, more complicated companies for us and <span class='client-quote-highlight' >her rates are proportionately appropriate.</span > </p>",
          "author": "JWC, Veneta OR",
          "highlight": "appropriate rates"
        }
      ]
    }
  ]
}
